<template>
  <div class = "BoxMain">
    <section id="section1">
      <h6>Информация о компании</h6>
      "The Sewing Company" - это ведущая швейная фабрика, специализирующаяся на производстве высококачественной одежды. Мы являемся лидерами в отрасли благодаря нашей многолетней экспертизе и приверженности к инновациям. Наша команда состоит из талантливых дизайнеров, опытных мастеров-швей и преданных сотрудников, которые работают вместе, чтобы создавать уникальные модели для клиентов по всему миру.
    </section>
    <section id="section2">
      <h6>Наша продукция</h6>
      Мы предлагаем широкий ассортимент продукции, включая женскую, мужскую и детскую одежду. Мы разрабатываем и производим платья, пальто, блузы, брюки, юбки и многое другое. Наша продукция отличается не только качеством и стилем, но и уникальными деталями, которые делают каждую модель особенной. Мы тщательно отбираем материалы и следим за каждой стадией производства, чтобы обеспечить нашим клиентам исключительные изделия.
    </section>
  </div>
</template>

<script>
</script>

<style>
section {
display: grid;
justify-content: center;
align-items: center;
text-align: justify;
margin: 3%
}

h6 {
font-size: 24px;
margin: 2%;
font-weight: bolder;
}

.BoxMain {
color: #ffffff;
background: url("../assets/back.jpg");
width: 60%;
box-shadow: 0 5px 10px #030a28;
margin: 5vh auto;
padding: 2em;
  border-radius: 10px;
  transition: transform .3s;
}

.BoxMain:hover{
 transform: scale(1.02);
}
</style>
